{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4e948148",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "import pandas as pd\n",
    "from scipy.stats import gaussian_kde # Разрешено для сравнения, не для реализации алгоритма\n",
    "\n",
    "# 1. Реализация алгоритма KDE с использованием только numpy/pandas\n",
    "\n",
    "class SimpleKDE:\n",
    "    \"\"\"\n",
    "    Простая реализация Kernel Density Estimation (KDE)\n",
    "    с использованием только numpy и pandas.\n",
    "    Использует Гауссовское ядро и правило Сильвермана для выбора полосы пропускания.\n",
    "    \"\"\"\n",
    "    def __init__(self, bandwidth=None):\n",
    "        \"\"\"\n",
    "        Инициализация KDE.\n",
    "\n",
    "        Args:\n",
    "            bandwidth (float, optional): Полоса пропускания (h). Если None,\n",
    "                                         используется правило Сильвермана.\n",
    "                                         По умолчанию None.\n",
    "        \"\"\"\n",
    "        self.bandwidth = bandwidth\n",
    "        self.data = None\n",
    "        self.n = 0\n",
    "        self.sigma = 0.0\n",
    "\n",
    "    def fit(self, data):\n",
    "        \"\"\"\n",
    "        Обучает модель KDE на данных.\n",
    "\n",
    "        Args:\n",
    "            data (np.ndarray или pd.Series): Входные данные (1D массив).\n",
    "        \"\"\"\n",
    "        if not isinstance(data, (np.ndarray, pd.Series)):\n",
    "            raise TypeError(\"Входные данные должны быть np.ndarray или pd.Series\")\n",
    "        if data.ndim != 1:\n",
    "             raise ValueError(\"Входные данные должны быть 1D массивом\")\n",
    "\n",
    "        self.data = np.asarray(data)\n",
    "        self.n = len(self.data)\n",
    "        if self.n == 0:\n",
    "            self.sigma = 0.0\n",
    "            if self.bandwidth is None:\n",
    "                self.bandwidth = 1.0 # Дефолтное значение для пустых данных\n",
    "            return\n",
    "\n",
    "        self.sigma = np.std(self.data)\n",
    "\n",
    "        # Правило Сильвермана для выбора полосы пропускания (h)\n",
    "        if self.bandwidth is None:\n",
    "            # Избегаем деления на ноль или очень маленьких чисел, если std = 0\n",
    "            if self.sigma < 1e-9:\n",
    "                 # Если все точки одинаковы, выбираем небольшую полосу пропускания\n",
    "                 self.bandwidth = 1.0\n",
    "            else:\n",
    "                self.bandwidth = (4 * self.sigma**5 / (3 * self.n))**(1/5)\n",
    "\n",
    "        # Дополнительная проверка на очень маленькую полосу пропускания\n",
    "        if self.bandwidth < 1e-9:\n",
    "             self.bandwidth = 1e-9\n",
    "\n",
    "\n",
    "    def _gaussian_kernel(self, u):\n",
    "        \"\"\"\n",
    "        Гауссовское ядро.\n",
    "\n",
    "        Args:\n",
    "            u (np.ndarray): Входные значения для ядра.\n",
    "\n",
    "        Returns:\n",
    "            np.ndarray: Выходные значения ядра.\n",
    "        \"\"\"\n",
    "        return (1 / np.sqrt(2 * np.pi)) * np.exp(-0.5 * u**2)\n",
    "\n",
    "    def predict(self, points):\n",
    "        \"\"\"\n",
    "        Оценивает плотность в заданных точках.\n",
    "\n",
    "        Args:\n",
    "            points (np.ndarray или pd.Series): Точки, в которых нужно оценить плотность.\n",
    "\n",
    "        Returns:\n",
    "            np.ndarray: Оцененная плотность в заданных точках.\n",
    "        \"\"\"\n",
    "        if self.data is None or self.n == 0:\n",
    "            # Если данных нет, плотность везде равна 0\n",
    "            return np.zeros_like(points, dtype=float)\n",
    "\n",
    "        points = np.asarray(points)\n",
    "        if points.ndim != 1:\n",
    "             raise ValueError(\"Точки для оценки должны быть 1D массивом\")\n",
    "\n",
    "        # Применение формулы KDE: f(x) = (1/nh) * sum(K((x - xi) / h))\n",
    "        density_estimates = np.zeros_like(points, dtype=float)\n",
    "\n",
    "        for i, p in enumerate(points):\n",
    "            # Вычисляем (x - xi) / h для всех точек данных\n",
    "            u = (p - self.data) / self.bandwidth\n",
    "            # Применяем ядро к u\n",
    "            kernel_values = self._gaussian_kernel(u)\n",
    "            # Суммируем значения ядра и масштабируем\n",
    "            density_estimates[i] = np.sum(kernel_values) / (self.n * self.bandwidth)\n",
    "\n",
    "        return density_estimates\n",
    "\n",
    "# 2. Симуляция данных для тестирования\n",
    "\n",
    "# Генерируем данные из нормального распределения\n",
    "np.random.seed(42) # Для воспроизводимости\n",
    "simulated_data = np.random.normal(loc=5, scale=2, size=100) # 100 точек, среднее 5, стд откл 2\n",
    "\n",
    "# Генерируем точки, в которых будем оценивать плотность\n",
    "evaluation_points = np.linspace(0, 10, 200) # 200 точек от 0 до 10\n",
    "\n",
    "# 3. Сравнение со стандартной реализацией (scipy)\n",
    "\n",
    "# Используем нашу реализацию\n",
    "my_kde = SimpleKDE()\n",
    "my_kde.fit(simulated_data)\n",
    "my_density = my_kde.predict(evaluation_points)\n",
    "\n",
    "# Используем стандартную реализацию из scipy\n",
    "scipy_kde = gaussian_kde(simulated_data)\n",
    "scipy_density = scipy_kde(evaluation_points)\n",
    "\n",
    "# Выводим полосу пропускания, использованную нашей реализацией\n",
    "print(f\"Полоса пропускания (h) нашей реализации: {my_kde.bandwidth:.4f}\")\n",
    "print(f\"Полоса пропускания (h) scipy реализации (оценка): {scipy_kde.factor * np.std(simulated_data):.4f}\") # scipy.gaussian_kde.factor - это множитель для std\n",
    "\n",
    "# Сравнение результатов\n",
    "# Вычисляем среднеквадратичную ошибку (MSE) между двумя оценками плотности\n",
    "mse = np.mean((my_density - scipy_density)**2)\n",
    "print(f\"Среднеквадратичная ошибка между нашей и scipy реализациями: {mse:.6f}\")\n",
    "\n",
    "# Визуализация (опционально, но полезно для проверки)\n",
    "# Для визуализации потребуется matplotlib, который не входит в numpy/pandas.\n",
    "# Если разрешено использовать matplotlib для визуализации, раскомментируйте следующий блок:\n",
    "\n",
    "# import matplotlib.pyplot as plt\n",
    "#\n",
    "# plt.figure(figsize=(10, 6))\n",
    "# plt.plot(evaluation_points, my_density, label='Наша реализация KDE')\n",
    "# plt.plot(evaluation_points, scipy_density, label='scipy.stats.gaussian_kde')\n",
    "# plt.hist(simulated_data, bins=30, density=True, alpha=0.5, label='Гистограмма данных')\n",
    "# plt.title('Сравнение KDE: Наша реализация vs SciPy')\n",
    "# plt.xlabel('Значение')\n",
    "# plt.ylabel('Плотность')\n",
    "# plt.legend()\n",
    "# plt.grid(True)\n",
    "# plt.show()\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
